In [1]:
import pandas as pd

concatenate on same column

In [5]:
df1=pd.DataFrame([
    [1,5]
    ,[5,2]
])
df1.columns=['A',"B"]
df1

   A  B
0  1  5
1  5  2

In [7]:
df2=pd.DataFrame([
    [12,5],
    [1,4]
])
df2.columns=['A','B']
df2

    A  B
0  12  5
1   1  4

In [8]:
pd.concat([df1,df2])

    A  B
0   1  5
1   5  2
0  12  5
1   1  4

2)Concat on various Column

In [9]:
df1=pd.DataFrame([
    [1,5]
    ,[5,2]
])
df1.columns=['A',"B"]
df1

   A  B
0  1  5
1  5  2

In [10]:
df2=pd.DataFrame([
    [12,5],
    [1,4]
])
df2.columns=['A','B']
df2

    A  B
0  12  5
1   1  4

In [11]:
pd.concat([df1,df2])

    A  B
0   1  5
1   5  2
0  12  5
1   1  4

In [12]:
#Concate mixed COlumn
df1=pd.DataFrame([
    [1,5]
    ,[5,2]
])
df1.columns=['A',"B"]
df1

   A  B
0  1  5
1  5  2

In [14]:
df2=pd.DataFrame([
    [12,5],
    [1,4]
])
df2.columns=['B','C']
df2

    B  C
0  12  5
1   1  4

In [16]:
pd.concat([df1,df2])

     A   B    C
0  1.0   5  NaN
1  5.0   2  NaN
0  NaN  12  5.0
1  NaN   1  4.0